CFD-DEM/test1/sphere/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (-4 -25 -4) 
    (4 -25 -4) 
    (4 5 -4) 
    (-4 5 -4) 
    (-4 -25 4)
    (4 -25 4) 
    (4 5 4) 
    (-4 5 4) 
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (32 120 32) simpleGrading (1 1 1) 
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)
            
        );
    }
    outlet
    {
        type wall;
        faces
        (
          (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
